In [55]:
import warnings

warnings.filterwarnings("ignore")

In [56]:
import numpy as np 
import pandas as pd 
from matplotlib import pyplot as plt
import seaborn as sns

In [57]:
import pandas as pd
import requests

country = 'sri lanka'
api_url = 'https://api.api-ninjas.com/v1/covid19?country={}'.format(country)

headers = {'X-Api-Key': '3EUMbhcelIreko7nxnShRw==6LOVjUhGnyFbocX7'}

try:
    response = requests.get(api_url, headers=headers)
    
    if response.status_code == requests.codes.ok:
        data = response.json()
        
        # Extracting relevant data
        country_data = data
        
        # Creating DataFrame
        df = pd.DataFrame(country_data)
        
    else:
        print("Error:", response.status_code, response.text)
        
except Exception as e:
    print("Error:", e)

In [58]:
df.head()

     country region                                              cases
0  Sri Lanka         {'2020-01-22': {'total': 0, 'new': 0}, '2020-0...

In [59]:
sl_data = pd.DataFrame.from_dict(df["cases"][0], orient='index')
sl_data.index.name = 'date'


sl_data = sl_data[['total', 'new']]
sl_data.reset_index(inplace=True)

In [61]:
sl_data["country"] = ["Sri Lanka" for x in range(0, len(sl_data))]

In [62]:
sl_data.head()

         date  total  new    country
0  2020-01-22      0    0  Sri Lanka
1  2020-01-23      0    0  Sri Lanka
2  2020-01-24      0    0  Sri Lanka
3  2020-01-25      0    0  Sri Lanka
4  2020-01-26      0    0  Sri Lanka

In [63]:
sl_data = sl_data[["country", "date", "new", "total"]]
sl_data.head()

     country        date  new  total
0  Sri Lanka  2020-01-22    0      0
1  Sri Lanka  2020-01-23    0      0
2  Sri Lanka  2020-01-24    0      0
3  Sri Lanka  2020-01-25    0      0
4  Sri Lanka  2020-01-26    0      0

In [64]:
sl_data.tail()

        country        date  new   total
1138  Sri Lanka  2023-03-05    2  672034
1139  Sri Lanka  2023-03-06    0  672034
1140  Sri Lanka  2023-03-07    2  672036
1141  Sri Lanka  2023-03-08    1  672037
1142  Sri Lanka  2023-03-09    2  672039

In [67]:
sl_data.to_csv("../FomaldihydeAnalysis/OtherData/final_covid_data.csv")